In [2]:
import pandas as pd
import numpy as np
import os
os.chdir("C:\\Users\\sfrie\\Python\\pandas\\udemy_pandas_files")
df = pd.read_csv('tips.csv')

### Describe and Transpose

In [4]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [6]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

### Max, Min, Correlation, and Value Counts

In [11]:
#We can sort our df with the sort_value method. By adding a second arguement surround by [], we can sort by a second layer as well.
df.sort_values(['tip', 'size']).head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959

In [18]:
#We can find the max and min values using .max and .min.
df['total_bill'].max()

50.81

In [19]:
#We can use .idxmax or idxmin to find the index value of the max or min, and put it into iloc to find the whole row
df['total_bill'].idxmax()
df.iloc[df['total_bill'].idxmax()]
#WE can also use idxmax with Axis = 1 to find the id of the column in a row with the highest value.

total_bill                     50.81
tip                            10.00
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [20]:
#We can show a table of pearson correlations between different columns using df.corr()
df.corr()

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [22]:
#Value counts method allows us to get the counts per category. We can only call this on categorical data, like male or female.
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [24]:
#Similarly, we can use unique to give an array of the unique values of a column, as well as nunique to retrieve the number of uniqe values (or, we can run len() on unique() to do the same)
print(df['day'].unique())
print(df['day'].nunique())

['Sun' 'Sat' 'Thur' 'Fri']
4

### Switching and Replacing

In [25]:
#Lets say we want to replace female an male with f and m.
df['sex'].replace(['Female', 'Male'], ['F', 'M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [26]:
#Simiarly, we can using the map method to assign the replacement through a dictionary. Replace is easier for fewer items, and map is easier with many items.
mymap = {'Female': 'F', 'Male': 'M'}
df['sex'].map(mymap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

### Duplicate Rows

In [28]:
#WE can used the duplicated method to check if there is any duplicated date inside of our data frame.
simple_df = pd.DataFrame([1,2,2], ['a','b','c'])
simple_df.duplicated()

a    False
b    False
c     True
dtype: bool

In [29]:
#To remove the duplicated data, we use drop_dupliactes
simple_df.drop_duplicates()

   0
a  1
b  2

### Between

In [32]:
#If we want to know the values betweena  range:
df[df['total_bill'].between(10,20, inclusive = True)].head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546

### nlargest and nsmallest

In [35]:
#nlargest and nsmallest return n amounts of rows with the largest or smallest values, given a specified column.
#This is essentially just calling a sort value, and then using head()
# #  (df.sort_values('tip, ascending = False).head(3)
df.nlargest(5, 'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025

In [5]:
#To take a random sample of our data frame, we can do this in two ways- a sample number of rows, or sample based off a fraction. This is particularly useful when you don't know how many rows are in your data frame, but you need a specfic sample size. 

df.sample(5)
df.sample(frac = 0.1).head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
22,15.77,2.23,Female,No,Sat,Dinner,2,7.88,Ashley Shelton,3524119516293213,Sat9786
85,34.83,5.17,Female,No,Thur,Lunch,4,8.71,Shawna Cook,6011787464177340,Thur7972
109,14.31,4.00,Female,Yes,Sat,Dinner,2,7.16,Amanda Anderson,375638820334211,Sat2614
215,12.90,1.10,Female,Yes,Sat,Dinner,2,6.45,Jessica Owen,4726904879471,Sat6983
21,20.29,2.75,Female,No,Sat,Dinner,2,10.14,Natalie Gardner,5448125351489749,Sat9618